use hibernate_lesson_7;

delete from product where true;

INSERT INTO product (name, price)
VALUES
       ('Хлеб', 30),
       ('Мороженное', 120),
       ('Млоко', 70),
       ('Яйца', 80),
       ('Кола', 94),
       ('Чизкейк', 400),
       ('Кофе', 120),
       ('Какао', 160),
       ('Наггенсы', 80),
       ('Блинчики', 70),
       ('Вода', 90),
       ('Зубная паста', 110),
       ('Жидкое мыло', 65),
       ('Пельмени', 250),
       ('Сырные палки', 200),
       ('Грибы', 70),
       ('Шоколадка', 99),
       ('Печенье', 120);
